## Plan Result (853: prod - TerraformPlanApply)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_definition.custom_roles[&#34;PIM Azure Contributor&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_definition.custom_roles["PIM Azure Contributor"] will be created
  + resource "azurerm_role_definition" "custom_roles" {
      + assignable_scopes           = (known after apply)
      + description                 = "A role that users can activate via PIM to provide contributor access"
      + id                          = (known after apply)
      + name                        = "PIM Azure Contributor"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/providers/Microsoft.Management/managementGroups/HMCTS"

      + permissions {
          + actions      = [
              + "*",
            ]
          + data_actions = [
              + "*",
            ]
          + not_actions  = [
              + "Microsoft.Authorization/*/Delete",
              + "Microsoft.Authorization/*/Write",
              + "Microsoft.Authorization/elevateAccess/Action",
              + "Microsoft.Blueprint/blueprintAssignments/write",
              + "Microsoft.Blueprint/blueprintAssignments/delete",
              + "Microsoft.Compute/galleries/share/action",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":145,"Program":"tfcmt","SHA1":"","Target":"853: prod - TerraformPlanApply","Vars":{}} -->